Revit 2027 API
IEntryPoint Interface
The interface supporting Document and Application level entry point classes for macros.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IEntryPoint
Public Interface IEntryPoint
public interface class IEntryPoint
type IEntryPoint = interface end
The IEntryPoint type exposes the following members.
Properties
Name | Description
AddinFolder
Top
Methods
Name | Description
FinishInitialization
Initialize
OnShutdown
Top
See Also
Reference
Autodesk.Revit.DB.Macros Namespace